Revit 2027 API
SunAndShadowSettings.ActiveFrameTime Property
 Identifies the date and time of the SunAndShadowSettings element for the active frame.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DateTime ActiveFrameTime { get; }
Public ReadOnly Property ActiveFrameTime As DateTime
	Get
public:
property DateTime ActiveFrameTime {
	DateTime get ();
}
member ActiveFrameTime : DateTime with get
Property Value
DateTime
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace